{
  "</answer>": 32012,
  "</think>": 32010,
  "<answer>": 32011,
  "<im_end>": 32014,
  "<im_start>": 32013,
  "<think>": 32009,
  "[SEG0]": 32000,
  "[SEG1]": 32001,
  "[SEG2]": 32002,
  "[SEG3]": 32003,
  "[SEG4]": 32004,
  "[SEG5]": 32005,
  "[SEG6]": 32006,
  "[SEG7]": 32007,
  "[SEG8]": 32008
}
