{
  "_name_or_path": "path_to_llava-v1.6-vicuna-7b",
  "architectures": [
    "PixDLMForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "freeze_mm_mlp_adapter": true,
  "freeze_mm_vision_resampler": false,
  "freeze_vision": false,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "image_aspect_ratio": "square",
  "image_crop_resolution": 224,
  "image_feature_scale_num": 3,
  "image_grid_pinpoints": null,
  "image_split_resolution": 224,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "is_multipath_encoder": true,
  "max_position_embeddings": 4096,
  "mm_hidden_size": 1024,
  "mm_patch_merge_type": "spatial_unpad",
  "mm_projector_hidden_dim": 2,
  "mm_projector_lr": null,
  "mm_projector_out_dim": 1,
  "mm_projector_type": "mlp2x_gelu",
  "mm_resampler_type": null,
  "mm_use_im_patch_token": false,
  "mm_use_im_start_end": true,
  "mm_vision_select_feature": "patch",
  "mm_vision_select_layer": -2,
  "mm_vision_tower": "openai/clip-vit-large-patch14",
  "mm_vision_tower_lr": 2e-06,
  "model_type": "llava",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 32,
  "out_dim": 256,
  "pad_token_id": 0,
  "pad_train_clip_images": false,
  "pretrain_mm_mlp_adapter": null,
  "pretraining_tp": 1,
  "resize_vision_tower": true,
  "resize_vision_tower_size": 448,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "separate_mm_projector": false,
  "three_level_multi_scale_decoder": true,
  "tie_word_embeddings": false,
  "tokenizer_model_max_length": 4096,
  "tokenizer_padding_side": "right",
  "torch_dtype": "bfloat16",
  "train_mask_decoder": true,
  "transformers_version": "4.31.0",
  "tune_mm_mlp_adapter": false,
  "tune_mm_vision_resampler": false,
  "unfreeze_mm_vision_tower": true,
  "use_cache": false,
  "use_mm_proj": true,
  "vision_tower": "openai/clip-vit-large-patch14",
  "vision_tower_for_mask": true,
  "vocab_size": 32015
}
